Revit 2027 API
View.GetSketchyLines Method
 Returns the current sketchy lines settings for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewDisplaySketchyLines GetSketchyLines()
Public Function GetSketchyLines As ViewDisplaySketchyLines
public:
ViewDisplaySketchyLines^ GetSketchyLines()
member GetSketchyLines : unit -> ViewDisplaySketchyLines
Return Value
ViewDisplaySketchyLines
 Current sketchy lines settings.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace